batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
/*
 * File: daq.c
 *
 * Code generated for Simulink model :daq.
 *
 * Model version      : 1.18
 * Simulink Coder version    : 8.6 (R2014a) 27-Dec-2013
 * TLC version       : 8.6 (Jan 30 2014)
 * C/C++ source code generated on  : Sun Jun 07 16:10:57 2015
 *
 * Target selection: stm32F4xx.tlc
 * Embedded hardware selection: STMicroelectronics->STM32F4xx 32-bit Cortex-M4
 * Code generation objectives:
 *    1. Execution efficiency
 *    2. Debugging
 * Validation result: Not run
 *
 *
 *
 * ******************************************************************************
 * * attention
 * *
 * * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 * * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 * * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
 * * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 * * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 * * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 * *
 * ******************************************************************************
 */

#include "daq.h"
#include "daq_private.h"
#define USART1_RX_BUFF_SIZE            18
#define USART1_RX_STRING_SIZE          18
#define USART3_RX_BUFF_SIZE            1000
#define USART3_RX_STRING_SIZE          100
#define USART6_RX_BUFF_SIZE            1000
#define USART6_RX_STRING_SIZE          100
#define USART2_RX_BUFF_SIZE            18
#define USART2_RX_STRING_SIZE          18

/* Global Variable Definition for TIM5 Configuration */
TIM_TimeBaseInitTypeDef TIM5_TimeBaseStructure;
TIM_OCInitTypeDef TIM5_OCInitStructure;

/*Global variable for APB1/APB2 prescaler from RCC_Configuration.c file */
extern uint32_t RCC_APB1_Prescaler;
extern uint32_t RCC_APB2_Prescaler;

/* Global Variable Definition for TIM4 Configuration */
TIM_TimeBaseInitTypeDef TIM4_TimeBaseStructure;
TIM_OCInitTypeDef TIM4_OCInitStructure;

/*Global variable for APB1/APB2 prescaler from RCC_Configuration.c file */
extern uint32_t RCC_APB1_Prescaler;
extern uint32_t RCC_APB2_Prescaler;

/* Global Variable Definition for ADC1 Configuration */
ADC_InitTypeDef ADC1_InitStructure;

#ifdef ADC1_NB_CH
#undef ADC1_NB_CH
#endif

#define ADC1_NB_CH                     (2 + 0)
#ifndef ADC2_NB_CH
#define ADC2_NB_CH                     0
#endif

#ifndef ADC3_NB_CH
#define ADC3_NB_CH                     0
#endif

/* Global Variable Definition for ADC Configuration */
ADC_CommonInitTypeDef ADC_CommonInitStructure;
DMA_InitTypeDef ADC_DMA2_InitStructure;

/* ADC mode definition is used to know DMA channel to use */
#define ADC_COMMON_MODE                ADC_Mode_Independent

/* DMA access mode definition is used to know data size */
#define ADC_DMA2_ACCESS_MODE           ADC_DMAAccessMode_Disabled

/* ADC1/2/3 DR address and common CCR address */
#define ADC1_DR_ADDRESS                ((uint32_t)0x4001204C)
#define ADC2_DR_ADDRESS                ((uint32_t)0x4001214C)
#define ADC3_DR_ADDRESS                ((uint32_t)0x4001224C)
#define ADC_CCR_ADDRESS                ((uint32_t)0x40012308)

/* Global Variable Definition for GPIOA Configuration */
GPIO_InitTypeDef GPIOA_InitStructure;

/* Global Variable Definition for GPIOB Configuration */
GPIO_InitTypeDef GPIOB_InitStructure;

/* Global Variable Definition for GPIOC Configuration */
GPIO_InitTypeDef GPIOC_InitStructure;

/* Global Variable Definition for GPIOD Configuration */
GPIO_InitTypeDef GPIOD_InitStructure;

/* Global Variable Definition for GPIOE Configuration */
GPIO_InitTypeDef GPIOE_InitStructure;

/* Global Variable Definition for GPIOF Configuration */
GPIO_InitTypeDef GPIOF_InitStructure;

/* Global Variable Definition for GPIOG Configuration */
GPIO_InitTypeDef GPIOG_InitStructure;

/* Global Variable Definition for GPIOH Configuration */
GPIO_InitTypeDef GPIOH_InitStructure;

/* Global Variable Definition for GPIOI Configuration */
GPIO_InitTypeDef GPIOI_InitStructure;

#define USART6_CONFIG_NAME             USART6
#define USART6_CONFIG_PIN_RX           GPIO_Pin_7
#define USART6_CONFIG_PIN_TX           GPIO_Pin_6
#define USART6_CONFIG_PORT_TX          GPIOC
#define USART6_CONFIG_PORT_RX          GPIOC

/* Enable usart peripheral clocks */
#define RCC_USART6_ClockCmd()          RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE)

/* Enable GPIO clocks */
#define USART6_RCC_GPIORx_ClockCmd()   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE)
#define USART6_RCC_GPIOTx_ClockCmd()

/* Configure AFIO Alternate fonction */
#define USART6_GPIOTx_PinAFConfig()    GPIO_PinAFConfig(GPIOC, GPIO_PinSource6, GPIO_AF_USART6)
#define USART6_GPIORx_PinAFConfig()    GPIO_PinAFConfig(GPIOC, GPIO_PinSource7, GPIO_AF_USART6)

/* Global Variable Definition for GPIO Configuration */
static GPIO_InitTypeDef GPIO_InitStructure;

/* Global Variable Definition for UART Configuration */
static USART_InitTypeDef USART6_InitStructure;
static USART_ClockInitTypeDef USART6_ClockInitStructure;

/* USART6 interrupt receive */
#define USART6_IT_RCV                  1

/* USART6 interrupt send */
#define USART6_IT_SEND                 1

NVIC_InitTypeDef NVIC_USART6_InitStructure;
static volatile unsigned int USART6_NbrOfDataInBuff = 0;
static char USART6_RxBuffer[USART6_RX_BUFF_SIZE];
static char USART6_RxOutputDataBuffer[USART6_RX_STRING_SIZE] = { 0 };

static char* USART6_RxOutputDataBufferPt = USART6_RxOutputDataBuffer;
static char* USART6_ReadPt = USART6_RxBuffer;
static char* USART6_WritePt = USART6_RxBuffer;
static char* USART6_BufferSendPt;
static uint16_t USART6_NbCharToSend = 0;
static uint16_t USART6_NbCharSent = 0;

#define USART2_CONFIG_NAME             USART2
#define USART2_CONFIG_PIN_RX           GPIO_Pin_3
#define USART2_CONFIG_PIN_TX           GPIO_Pin_2
#define USART2_CONFIG_PORT_TX          GPIOA
#define USART2_CONFIG_PORT_RX          GPIOA

/* Enable usart peripheral clocks */
#define RCC_USART2_ClockCmd()          RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE)

