batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
/* Enable GPIO clocks */
#define USART2_RCC_GPIORx_ClockCmd()   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE)
#define USART2_RCC_GPIOTx_ClockCmd()

/* Configure AFIO Alternate fonction */
#define USART2_GPIOTx_PinAFConfig()    GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2)
#define USART2_GPIORx_PinAFConfig()    GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2)

/* Global Variable Definition for GPIO Configuration */
static GPIO_InitTypeDef GPIO_InitStructure;

/* Global Variable Definition for UART Configuration */
static USART_InitTypeDef USART2_InitStructure;
static USART_ClockInitTypeDef USART2_ClockInitStructure;

/* USART2 interrupt receive */
#define USART2_IT_RCV                  1

/* USART2 interrupt send */
#define USART2_IT_SEND                 1

NVIC_InitTypeDef NVIC_USART2_InitStructure;
static volatile unsigned int USART2_NbrOfDataInBuff = 0;
static char USART2_RxBuffer[USART2_RX_BUFF_SIZE];
static char USART2_RxOutputDataBuffer[USART2_RX_STRING_SIZE] = { 0 };

static char* USART2_RxOutputDataBufferPt = USART2_RxOutputDataBuffer;
static char* USART2_ReadPt = USART2_RxBuffer;
static char* USART2_WritePt = USART2_RxBuffer;
static char* USART2_BufferSendPt;
static uint16_t USART2_NbCharToSend = 0;
static uint16_t USART2_NbCharSent = 0;

#define USART1_CONFIG_NAME             USART1
#define USART1_CONFIG_PIN_RX           GPIO_Pin_10
#define USART1_CONFIG_PIN_TX           GPIO_Pin_9
#define USART1_CONFIG_PORT_TX          GPIOA
#define USART1_CONFIG_PORT_RX          GPIOA

/* Enable usart peripheral clocks */
#define RCC_USART1_ClockCmd()          RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE)

/* Enable GPIO clocks */
#define USART1_RCC_GPIORx_ClockCmd()   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE)
#define USART1_RCC_GPIOTx_ClockCmd()

/* Configure AFIO Alternate fonction */
#define USART1_GPIOTx_PinAFConfig()    GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_USART1)
#define USART1_GPIORx_PinAFConfig()    GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_USART1)

/* Global Variable Definition for GPIO Configuration */
static GPIO_InitTypeDef GPIO_InitStructure;

/* Global Variable Definition for UART Configuration */
static USART_InitTypeDef USART1_InitStructure;
static USART_ClockInitTypeDef USART1_ClockInitStructure;

/* USART1 interrupt receive */
#define USART1_IT_RCV                  1

/* USART1 interrupt send */
#define USART1_IT_SEND                 1

NVIC_InitTypeDef NVIC_USART1_InitStructure;
static volatile unsigned int USART1_NbrOfDataInBuff = 0;
static char USART1_RxBuffer[USART1_RX_BUFF_SIZE];
static char USART1_RxOutputDataBuffer[USART1_RX_STRING_SIZE] = { 0 };

static char* USART1_RxOutputDataBufferPt = USART1_RxOutputDataBuffer;
static char* USART1_ReadPt = USART1_RxBuffer;
static char* USART1_WritePt = USART1_RxBuffer;
static char* USART1_BufferSendPt;
static uint16_t USART1_NbCharToSend = 0;
static uint16_t USART1_NbCharSent = 0;

#define USART3_CONFIG_NAME             USART3
#define USART3_CONFIG_PIN_RX           GPIO_Pin_11
#define USART3_CONFIG_PIN_TX           GPIO_Pin_10
#define USART3_CONFIG_PORT_TX          GPIOC
#define USART3_CONFIG_PORT_RX          GPIOC

/* Enable usart peripheral clocks */
#define RCC_USART3_ClockCmd()          RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE)

/* Enable GPIO clocks */
#define USART3_RCC_GPIORx_ClockCmd()   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE)
#define USART3_RCC_GPIOTx_ClockCmd()

/* Configure AFIO Alternate fonction */
#define USART3_GPIOTx_PinAFConfig()    GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_USART3)
#define USART3_GPIORx_PinAFConfig()    GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_USART3)

/* Global Variable Definition for GPIO Configuration */
static GPIO_InitTypeDef GPIO_InitStructure;

/* Global Variable Definition for UART Configuration */
static USART_InitTypeDef USART3_InitStructure;
static USART_ClockInitTypeDef USART3_ClockInitStructure;

/* USART3 interrupt receive */
#define USART3_IT_RCV                  1

/* USART3 interrupt send */
#define USART3_IT_SEND                 1

NVIC_InitTypeDef NVIC_USART3_InitStructure;
static volatile unsigned int USART3_NbrOfDataInBuff = 0;
static char USART3_RxBuffer[USART3_RX_BUFF_SIZE];
static char USART3_RxOutputDataBuffer[USART3_RX_STRING_SIZE] = { 0 };

static char* USART3_RxOutputDataBufferPt = USART3_RxOutputDataBuffer;
static char* USART3_ReadPt = USART3_RxBuffer;
static char* USART3_WritePt = USART3_RxBuffer;
static char* USART3_BufferSendPt;
static uint16_t USART3_NbCharToSend = 0;
static uint16_t USART3_NbCharSent = 0;

/* Block signals (auto storage) */
B_daq daq_B;

/* Block states (auto storage) */
DW_daq daq_DW;

/* External inputs (root inport signals with auto storage) */
ExtU_daq daq_U;

/* External outputs (root outports fed by signals with auto storage) */
ExtY_daq daq_Y;

/* Real-time model */
RT_MODEL_daq daq_M_;
RT_MODEL_daq *const daq_M = &daq_M_;

/* Function Declaration for TIM5 Configuration */
void TIM5_Configuration(void);

/* Function Declaration for TIM4 Configuration */
void TIM4_Configuration(void);

/* Function Declaration for ADC1 Configuration */
void ADC1_Init(void);
void ADC1_Start(void);

/* Function Declaration for DMA Configuration used for ADC*/
void ADC_DMA_Common_Init(void);

/* Function Declaration for ADC Common Configuration */
void ADC_Common_Init(void);

/* Function Declaration for GPIOA Configuration */
void GPIOA_Configuration(void);

/* Function Declaration for GPIOB Configuration */
void GPIOB_Configuration(void);

/* Function Declaration for GPIOC Configuration */
void GPIOC_Configuration(void);

/* Function Declaration for GPIOD Configuration */
void GPIOD_Configuration(void);

/* Function Declaration for GPIOE Configuration */
void GPIOE_Configuration(void);

/* Function Declaration for GPIOF Configuration */
void GPIOF_Configuration(void);

/* Function Declaration for GPIOG Configuration */
void GPIOG_Configuration(void);

/* Function Declaration for GPIOH Configuration */
void GPIOH_Configuration(void);

/* Function Declaration for GPIOI Configuration */
void GPIOI_Configuration(void);

/* Function Declaration for USART6 Configuration */
void USART6_Config(void);

/* Function Declaration for USART2 Configuration */
void USART2_Config(void);

/* Function Declaration for USART1 Configuration */
void USART1_Config(void);

