batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
/* Function Declaration for USART3 Configuration */
void USART3_Config(void);

/*******************************************************************************
 * Function Name  : TIM5_Configuration
 * Description    : TIM5 PWM output or Input_Capture Configuration
 * Input          : -
 *******************************************************************************/
void TIM5_Configuration(void)
{
  /* Time base configuration */
  switch (RCC_APB1_Prescaler) {
   case RCC_HCLK_Div4:
    TIM5_TimeBaseStructure.TIM_Prescaler = (uint16_t) ((SystemCoreClock /2) /
      21000000) - 1;
    break;

   case RCC_HCLK_Div8:
    TIM5_TimeBaseStructure.TIM_Prescaler = (uint16_t) ((SystemCoreClock /4) /
      21000000) - 1;
    break;

   case RCC_HCLK_Div16:
    TIM5_TimeBaseStructure.TIM_Prescaler = (uint16_t) ((SystemCoreClock /8) /
      21000000) - 1;
    break;

   default:
    TIM5_TimeBaseStructure.TIM_Prescaler = (uint16_t)(SystemCoreClock / 21000000)
      - 1;
    break;
  }

  TIM5_TimeBaseStructure.TIM_Period = 21000000 / 100000 -1;
  TIM5_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
  TIM5_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM5, &TIM5_TimeBaseStructure);

  /* PWM output mode configuration: Channel CH1*/
  TIM5_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
  TIM5_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
  TIM5_OCInitStructure.TIM_Pulse = 50 * TIM5_TimeBaseStructure.TIM_Period / 100;
  TIM5_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
  TIM_OC1Init(TIM5, &TIM5_OCInitStructure);
  TIM_OC1PreloadConfig(TIM5, TIM_OCPreload_Enable);

  /* PWM output mode configuration: Channel CH2*/
  TIM5_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
  TIM5_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
  TIM5_OCInitStructure.TIM_Pulse = 50 * TIM5_TimeBaseStructure.TIM_Period / 100;
  TIM5_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
  TIM_OC2Init(TIM5, &TIM5_OCInitStructure);
  TIM_OC2PreloadConfig(TIM5, TIM_OCPreload_Enable);
  TIM_ARRPreloadConfig(TIM5, ENABLE);

  /* TIM5 enable counter */
  TIM_Cmd(TIM5, ENABLE);
}

/*******************************************************************************
 * Function Name  : TIM4_Configuration
 * Description    : TIM4 PWM output or Input_Capture Configuration
 * Input          : -
 *******************************************************************************/
void TIM4_Configuration(void)
{
  /* Time base configuration */
  switch (RCC_APB1_Prescaler) {
   case RCC_HCLK_Div4:
    TIM4_TimeBaseStructure.TIM_Prescaler = (uint16_t) ((SystemCoreClock /2) /
      21000000) - 1;
    break;

   case RCC_HCLK_Div8:
    TIM4_TimeBaseStructure.TIM_Prescaler = (uint16_t) ((SystemCoreClock /4) /
      21000000) - 1;
    break;

   case RCC_HCLK_Div16:
    TIM4_TimeBaseStructure.TIM_Prescaler = (uint16_t) ((SystemCoreClock /8) /
      21000000) - 1;
    break;

   default:
    TIM4_TimeBaseStructure.TIM_Prescaler = (uint16_t)(SystemCoreClock / 21000000)
      - 1;
    break;
  }

  TIM4_TimeBaseStructure.TIM_Period = 21000000 / 100000 -1;
  TIM4_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
  TIM4_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM4, &TIM4_TimeBaseStructure);

  /* PWM output mode configuration: Channel CH1*/
  TIM4_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
  TIM4_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
  TIM4_OCInitStructure.TIM_Pulse = 50 * TIM4_TimeBaseStructure.TIM_Period / 100;
  TIM4_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
  TIM_OC1Init(TIM4, &TIM4_OCInitStructure);
  TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);
  TIM_ARRPreloadConfig(TIM4, ENABLE);

  /* TIM4 enable counter */
  TIM_Cmd(TIM4, ENABLE);
}

/*******************************************************************************
 * Function Name  : ADC1_Init
 * Description    : ADC1 Initialisation
 * Input          : -
 *******************************************************************************/
void ADC1_Init(void)
{
  /* Enable ADC1 clock */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
  ADC1_InitStructure.ADC_Resolution = ADC_Resolution_12b;
  ADC1_InitStructure.ADC_ScanConvMode = DISABLE;
  ADC1_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC1_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
  ADC1_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T1_CC1;
  ADC1_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC1_InitStructure.ADC_NbrOfConversion = 1;
  ADC_Init(ADC1, &ADC1_InitStructure);

  /* ADC1 channel configuration *************************************/
  ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_3Cycles);

  /* ADC1 channel configuration *************************************/
  ADC_RegularChannelConfig(ADC1, ADC_Channel_3, 2, ADC_SampleTime_3Cycles);

#ifdef ADC1_USE_DMA

  /* Enable DMA request after last transfer (Single-ADC mode) */
  ADC_DMARequestAfterLastTransferCmd(ADC1, ENABLE);

#endif

#ifndef ADC1_USE_DMA
#ifdef ADC_USE_DMA

  /* Enable DMA request after last transfer (multi-ADC mode) ******************/
  ADC_MultiModeDMARequestAfterLastTransferCmd(ENABLE);

#endif
#endif

}

/*******************************************************************************
 * Function Name  : ADC1_Start
 * Description    : Enable and start convertion for ADC1
 * Input          : -
 *******************************************************************************/
void ADC1_Start(void)
{

#ifdef ADC1_USE_DMA

  /* Enable ADC1 DMA */
  ADC_DMACmd(ADC1, ENABLE);

#endif

  /* Enable ADC1 */
  ADC_Cmd(ADC1, ENABLE);

  /* Start ADC1 Regular Software Conversion */
  ADC_SoftwareStartConv(ADC1);
}

#if ( defined (ADC_USE_DMA) || defined (ADC1_USE_DMA) || defined (ADC2_USE_DMA) || defined (ADC3_USE_DMA) )

/*******************************************************************************
 * Function Name  : ADC_DMA_Common_Init
 * Description    : DMA configuration for ADC
 * Input          : -
 *******************************************************************************/
void ADC_DMA_Common_Init(void)
{
  /* Enable DMA2 peripheral clocks for ADCs*/
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);

  /* DMA2 configuration */
  ADC_DMA2_InitStructure.DMA_Channel = DMA2_CHANNEL_DEF;
  ADC_DMA2_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)ADC_DR_CCR_ADDRESS;
  ADC_DMA2_InitStructure.DMA_Memory0BaseAddr = (uint32_t)&ADC_DMA_BUFFER;
  ADC_DMA2_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
  ADC_DMA2_InitStructure.DMA_BufferSize = ADC_NUMBER_OF_CHANNELS;
  ADC_DMA2_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  if (ADC_NUMBER_OF_CHANNELS <= 1) {
    ADC_DMA2_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Disable;
  } else {
    ADC_DMA2_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  }

  ADC_DMA2_InitStructure.DMA_PeripheralDataSize =
    DMA_PeripheralDataSize_HalfWord;
  ADC_DMA2_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
  ADC_DMA2_InitStructure.DMA_Mode = DMA_Mode_Circular;
  ADC_DMA2_InitStructure.DMA_Priority = DMA_Priority_High;
  ADC_DMA2_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
  ADC_DMA2_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_HalfFull;
  ADC_DMA2_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
  ADC_DMA2_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
  DMA_Init(DMA2_STREAM_DEF, &ADC_DMA2_InitStructure);

  /* DMA2 enable */
  DMA_Cmd(DMA2_STREAM_DEF, ENABLE);
}

#endif

