batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
/*******************************************************************************
 * Function Name  : ADC_Common_Init
 * Description    : Parameter Initialisation for all ADCs
 * Input          : -
 *******************************************************************************/
void ADC_Common_Init(void)
{
  /* ADC Common Init */
  ADC_CommonInitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_CommonInitStructure.ADC_Prescaler = ADC_Prescaler_Div2;
  ADC_CommonInitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_Disabled;
  ADC_CommonInitStructure.ADC_TwoSamplingDelay = ADC_TwoSamplingDelay_5Cycles;
  ADC_CommonInit(&ADC_CommonInitStructure);
}

/*******************************************************************************
 * Function Name  : GPIOA_Configuration
 * Description    : GPIO PortA Configuration
 * Input          : -
 *******************************************************************************/
void GPIOA_Configuration(void)
{
  /* Enable GPIOA clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);

  /* GPIO default Value */
  GPIO_DeInit(GPIOA);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource0, GPIO_AF_TIM5);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_TIM5);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_4;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOA_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOA_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOA_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_ETH);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC, ENABLE);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC_Rx, ENABLE);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIOA_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_USART1);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_USART1);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIOA_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);
  GPIOA_InitStructure.GPIO_Pin = GPIO_Pin_12;
  GPIOA_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOA_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOA_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOA, &GPIOA_InitStructure);
  GPIO_Write(GPIOA,4192);
}

/*******************************************************************************
 * Function Name  : GPIOB_Configuration
 * Description    : GPIO PortB Configuration
 * Input          : -
 *******************************************************************************/
void GPIOB_Configuration(void)
{
  /* Enable GPIOB clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);

  /* GPIO default Value */
  GPIO_DeInit(GPIOB);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIOB_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIOB_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOB_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOB_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOB_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOB_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOB_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIOB_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);

