batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_USART3);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_USART3);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_12;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource12, GPIO_AF_OTG_HS_FS);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_OTG_HS, ENABLE);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_13;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource13, GPIO_AF_OTG_HS);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_OTG_HS_ULPI, ENABLE);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_14;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource14, GPIO_AF_OTG_HS_FS);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_OTG_HS, ENABLE);
  GPIOB_InitStructure.GPIO_Pin = GPIO_Pin_15;
  GPIOB_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOB_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOB, &GPIOB_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource15, GPIO_AF_OTG_HS_FS);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_OTG_HS, ENABLE);
  GPIO_Write(GPIOB,480);
}

/*******************************************************************************
 * Function Name  : GPIOC_Configuration
 * Description    : GPIO PortC Configuration
 * Input          : -
 *******************************************************************************/
void GPIOC_Configuration(void)
{
  /* Enable GPIOC clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);

  /* GPIO default Value */
  GPIO_DeInit(GPIOC);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOC_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource1, GPIO_AF_ETH);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC, ENABLE);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AN;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AN;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_4;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource4, GPIO_AF_ETH);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC_Rx, ENABLE);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource5, GPIO_AF_ETH);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC_Rx, ENABLE);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource6, GPIO_AF_USART6);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource7, GPIO_AF_USART6);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource8, GPIO_AF_SDIO);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SDIO, ENABLE);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource9, GPIO_AF_SDIO);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SDIO, ENABLE);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_SDIO);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SDIO, ENABLE);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_SDIO);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SDIO, ENABLE);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_12;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);

