batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_SDIO);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SDIO, ENABLE);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_13;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOC_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_14;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOC_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);
  GPIOC_InitStructure.GPIO_Pin = GPIO_Pin_15;
  GPIOC_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOC_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOC_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOC, &GPIOC_InitStructure);
  GPIO_Write(GPIOC,16385);
}

/*******************************************************************************
 * Function Name  : GPIOD_Configuration
 * Description    : GPIO PortD Configuration
 * Input          : -
 *******************************************************************************/
void GPIOD_Configuration(void)
{
  /* Enable GPIOD clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);

  /* GPIO default Value */
  GPIO_DeInit(GPIOD);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource2, GPIO_AF_SDIO);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SDIO, ENABLE);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_4;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_12;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource12, GPIO_AF_TIM4);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_13;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_14;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIOD_InitStructure.GPIO_Pin = GPIO_Pin_15;
  GPIOD_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOD_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOD_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOD, &GPIOD_InitStructure);
  GPIO_Write(GPIOD,61363);
}

/*******************************************************************************
 * Function Name  : GPIOE_Configuration
 * Description    : GPIO PortE Configuration
 * Input          : -
 *******************************************************************************/
void GPIOE_Configuration(void)
{
  /* Enable GPIOE clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);

  /* GPIO default Value */
  GPIO_DeInit(GPIOE);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_4;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_12;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_13;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_14;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIOE_InitStructure.GPIO_Pin = GPIO_Pin_15;
  GPIOE_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOE_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOE_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOE, &GPIOE_InitStructure);
  GPIO_Write(GPIOE,65535);
}

