batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
/*******************************************************************************
 * Function Name  : GPIOF_Configuration
 * Description    : GPIO PortF Configuration
 * Input          : -
 *******************************************************************************/
void GPIOF_Configuration(void)
{
  /* Enable GPIOF clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE);

  /* GPIO default Value */
  GPIO_DeInit(GPIOF);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_4;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_12;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_13;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_14;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIOF_InitStructure.GPIO_Pin = GPIO_Pin_15;
  GPIOF_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOF_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOF_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOF, &GPIOF_InitStructure);
  GPIO_Write(GPIOF,65535);
}

/*******************************************************************************
 * Function Name  : GPIOG_Configuration
 * Description    : GPIO PortG Configuration
 * Input          : -
 *******************************************************************************/
void GPIOG_Configuration(void)
{
  /* Enable GPIOG clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOG, ENABLE);

  /* GPIO default Value */
  GPIO_DeInit(GPIOG);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_4;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);

