batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource11, GPIO_AF_ETH);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC_Tx, ENABLE);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_12;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_13;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_14;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIOG_InitStructure.GPIO_Pin = GPIO_Pin_15;
  GPIOG_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOG_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOG_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOG, &GPIOG_InitStructure);
  GPIO_Write(GPIOG,38719);
}

/*******************************************************************************
 * Function Name  : GPIOH_Configuration
 * Description    : GPIO PortH Configuration
 * Input          : -
 *******************************************************************************/
void GPIOH_Configuration(void)
{
  /* Enable GPIOH clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOH, ENABLE);

  /* GPIO default Value */
  GPIO_DeInit(GPIOH);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOH_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOH_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOH_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_4;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOH_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOH_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource6, GPIO_AF_TIM12);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM12, ENABLE);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOH_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOH_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOH_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource10, GPIO_AF_TIM5);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource11, GPIO_AF_TIM5);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_12;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIOH_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_13;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource13, GPIO_AF_CAN1);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_14;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOH_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);
  GPIOH_InitStructure.GPIO_Pin = GPIO_Pin_15;
  GPIOH_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOH_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIOH_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOH, &GPIOH_InitStructure);
  GPIO_Write(GPIOH,16574);
}

/*******************************************************************************
 * Function Name  : GPIOI_Configuration
 * Description    : GPIO PortI Configuration
 * Input          : -
 *******************************************************************************/
void GPIOI_Configuration(void)
{
  /* Enable GPIOI clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOI, ENABLE);

  /* GPIO default Value */
  GPIO_DeInit(GPIOI);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);

