batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource0, GPIO_AF_SPI2);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource1, GPIO_AF_SPI2);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource2, GPIO_AF_SPI2);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource3, GPIO_AF_SPI2);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_4;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIOI_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOI_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOI_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOI_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIOI_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);

  /*Alternate function configuration */
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource9, GPIO_AF_CAN1);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIOI_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);
  GPIOI_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIOI_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIOI_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIOI_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOI, &GPIOI_InitStructure);
  GPIO_Write(GPIOI,32);
}

/*******************************************************************************
 * Function Name  : USART6_Config
 * Description    : USART Configuration
 * Input          : -
 *******************************************************************************/
void USART6_Config(void)
{
  // USART6 IO configuration ------------------------------------//
  // Enable GPIO clock
  USART6_RCC_GPIORx_ClockCmd();
  USART6_RCC_GPIOTx_ClockCmd();

  // Set USART_TX as PP AF
  GPIO_InitStructure.GPIO_Pin = USART6_CONFIG_PIN_TX;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(USART6_CONFIG_PORT_TX, &GPIO_InitStructure);

  // Set USART_RX as Pull-Up
  GPIO_InitStructure.GPIO_Pin = USART6_CONFIG_PIN_RX;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(USART6_CONFIG_PORT_RX, &GPIO_InitStructure);

  // configure AFIO
  USART6_GPIOTx_PinAFConfig();
  USART6_GPIORx_PinAFConfig();

  //USART6 clock enable
  RCC_USART6_ClockCmd();
  USART6_InitStructure.USART_BaudRate = 921600;
  USART6_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART6_InitStructure.USART_StopBits = USART_StopBits_1;
  USART6_InitStructure.USART_Parity = USART_Parity_No;
  USART6_InitStructure.USART_HardwareFlowControl =
    USART_HardwareFlowControl_None;
  USART6_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART6_ClockInitStructure.USART_Clock = USART_Clock_Disable;
  USART6_ClockInitStructure.USART_CPOL = USART_CPOL_Low;
  USART6_ClockInitStructure.USART_CPHA = USART_CPHA_2Edge;
  USART6_ClockInitStructure.USART_LastBit = USART_LastBit_Disable;
  USART_Init(USART6_CONFIG_NAME, &USART6_InitStructure);
  USART_ClockInit(USART6_CONFIG_NAME, &USART6_ClockInitStructure);

  // Enable USART6 selected from PIL config model.
  USART_Cmd(USART6_CONFIG_NAME, ENABLE);
}

/*******************************************************************************
 * Function Name  : USART6_IRQHandler
 * Description    : USART interrupt reception management.
 * Input          : -
 *******************************************************************************/
void USART6_IRQHandler(void);
void USART6_IRQHandler(void)
{
  if (USART_GetITStatus(USART6, USART_IT_RXNE) != RESET) {
    /* Read one byte from the receive data register */
    if (USART6_NbrOfDataInBuff < USART6_RX_BUFF_SIZE) {
      *USART6_WritePt++ = USART6->DR;
      USART6_NbrOfDataInBuff++;
      if (USART6_WritePt > &USART6_RxBuffer[USART6_RX_BUFF_SIZE])
        USART6_WritePt = USART6_RxBuffer;
    } else {
      /* Take care: Char is lost. Increase Buffer size.*/
      (void)USART6->DR;
    }
  }

  if (USART_GetITStatus(USART6, USART_IT_TXE) != RESET) {
    USART_SendData(USART6, *USART6_BufferSendPt++);
    USART6_NbCharSent++;
    if (--USART6_NbCharToSend <= 0)
      USART_ITConfig(USART6, USART_IT_TXE, DISABLE);
  }
}

