batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
/*******************************************************************************
 * Function Name  : USART2_Config
 * Description    : USART Configuration
 * Input          : -
 *******************************************************************************/
void USART2_Config(void)
{
  // USART2 IO configuration ------------------------------------//
  // Enable GPIO clock
  USART2_RCC_GPIORx_ClockCmd();
  USART2_RCC_GPIOTx_ClockCmd();

  // Set USART_TX as PP AF
  GPIO_InitStructure.GPIO_Pin = USART2_CONFIG_PIN_TX;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(USART2_CONFIG_PORT_TX, &GPIO_InitStructure);

  // Set USART_RX as Pull-Up
  GPIO_InitStructure.GPIO_Pin = USART2_CONFIG_PIN_RX;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(USART2_CONFIG_PORT_RX, &GPIO_InitStructure);

  // configure AFIO
  USART2_GPIOTx_PinAFConfig();
  USART2_GPIORx_PinAFConfig();

  //USART2 clock enable
  RCC_USART2_ClockCmd();
  USART2_InitStructure.USART_BaudRate = 115200;
  USART2_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART2_InitStructure.USART_StopBits = USART_StopBits_1;
  USART2_InitStructure.USART_Parity = USART_Parity_No;
  USART2_InitStructure.USART_HardwareFlowControl =
    USART_HardwareFlowControl_None;
  USART2_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART2_ClockInitStructure.USART_Clock = USART_Clock_Disable;
  USART2_ClockInitStructure.USART_CPOL = USART_CPOL_Low;
  USART2_ClockInitStructure.USART_CPHA = USART_CPHA_2Edge;
  USART2_ClockInitStructure.USART_LastBit = USART_LastBit_Disable;
  USART_Init(USART2_CONFIG_NAME, &USART2_InitStructure);
  USART_ClockInit(USART2_CONFIG_NAME, &USART2_ClockInitStructure);

  // Enable USART2 selected from PIL config model.
  USART_Cmd(USART2_CONFIG_NAME, ENABLE);
}

/*******************************************************************************
 * Function Name  : USART2_IRQHandler
 * Description    : USART interrupt reception management.
 * Input          : -
 *******************************************************************************/
void USART2_IRQHandler(void);
void USART2_IRQHandler(void)
{
  if (USART_GetITStatus(USART2, USART_IT_RXNE) != RESET) {
    /* Read one byte from the receive data register */
    if (USART2_NbrOfDataInBuff < USART2_RX_BUFF_SIZE) {
      *USART2_WritePt++ = USART2->DR;
      USART2_NbrOfDataInBuff++;
      if (USART2_WritePt > &USART2_RxBuffer[USART2_RX_BUFF_SIZE])
        USART2_WritePt = USART2_RxBuffer;
    } else {
      /* Take care: Char is lost. Increase Buffer size.*/
      (void)USART2->DR;
    }
  }

  if (USART_GetITStatus(USART2, USART_IT_TXE) != RESET) {
    USART_SendData(USART2, *USART2_BufferSendPt++);
    USART2_NbCharSent++;
    if (--USART2_NbCharToSend <= 0)
      USART_ITConfig(USART2, USART_IT_TXE, DISABLE);
  }
}

/*******************************************************************************
 * Function Name  : USART1_Config
 * Description    : USART Configuration
 * Input          : -
 *******************************************************************************/
void USART1_Config(void)
{
  // USART1 IO configuration ------------------------------------//
  // Enable GPIO clock
  USART1_RCC_GPIORx_ClockCmd();
  USART1_RCC_GPIOTx_ClockCmd();

  // Set USART_TX as PP AF
  GPIO_InitStructure.GPIO_Pin = USART1_CONFIG_PIN_TX;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(USART1_CONFIG_PORT_TX, &GPIO_InitStructure);

  // Set USART_RX as Pull-Up
  GPIO_InitStructure.GPIO_Pin = USART1_CONFIG_PIN_RX;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(USART1_CONFIG_PORT_RX, &GPIO_InitStructure);

  // configure AFIO
  USART1_GPIOTx_PinAFConfig();
  USART1_GPIORx_PinAFConfig();

  //USART1 clock enable
  RCC_USART1_ClockCmd();
  USART1_InitStructure.USART_BaudRate = 921600;
  USART1_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART1_InitStructure.USART_StopBits = USART_StopBits_1;
  USART1_InitStructure.USART_Parity = USART_Parity_No;
  USART1_InitStructure.USART_HardwareFlowControl =
    USART_HardwareFlowControl_None;
  USART1_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART1_ClockInitStructure.USART_Clock = USART_Clock_Disable;
  USART1_ClockInitStructure.USART_CPOL = USART_CPOL_Low;
  USART1_ClockInitStructure.USART_CPHA = USART_CPHA_2Edge;
  USART1_ClockInitStructure.USART_LastBit = USART_LastBit_Disable;
  USART_Init(USART1_CONFIG_NAME, &USART1_InitStructure);
  USART_ClockInit(USART1_CONFIG_NAME, &USART1_ClockInitStructure);

  // Enable USART1 selected from PIL config model.
  USART_Cmd(USART1_CONFIG_NAME, ENABLE);
}

/*******************************************************************************
 * Function Name  : USART1_IRQHandler
 * Description    : USART interrupt reception management.
 * Input          : -
 *******************************************************************************/
void USART1_IRQHandler(void);
void USART1_IRQHandler(void)
{
  if (USART_GetITStatus(USART1, USART_IT_RXNE) != RESET) {
    /* Read one byte from the receive data register */
    if (USART1_NbrOfDataInBuff < USART1_RX_BUFF_SIZE) {
      *USART1_WritePt++ = USART1->DR;
      USART1_NbrOfDataInBuff++;
      if (USART1_WritePt > &USART1_RxBuffer[USART1_RX_BUFF_SIZE])
        USART1_WritePt = USART1_RxBuffer;
    } else {
      /* Take care: Char is lost. Increase Buffer size.*/
      (void)USART1->DR;
    }
  }

  if (USART_GetITStatus(USART1, USART_IT_TXE) != RESET) {
    USART_SendData(USART1, *USART1_BufferSendPt++);
    USART1_NbCharSent++;
    if (--USART1_NbCharToSend <= 0)
      USART_ITConfig(USART1, USART_IT_TXE, DISABLE);
  }
}

/*******************************************************************************
 * Function Name  : USART3_Config
 * Description    : USART Configuration
 * Input          : -
 *******************************************************************************/
void USART3_Config(void)
{
  // USART3 IO configuration ------------------------------------//
  // Enable GPIO clock
  USART3_RCC_GPIORx_ClockCmd();
  USART3_RCC_GPIOTx_ClockCmd();

