batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
  // Set USART_TX as PP AF
  GPIO_InitStructure.GPIO_Pin = USART3_CONFIG_PIN_TX;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(USART3_CONFIG_PORT_TX, &GPIO_InitStructure);

  // Set USART_RX as Pull-Up
  GPIO_InitStructure.GPIO_Pin = USART3_CONFIG_PIN_RX;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(USART3_CONFIG_PORT_RX, &GPIO_InitStructure);

  // configure AFIO
  USART3_GPIOTx_PinAFConfig();
  USART3_GPIORx_PinAFConfig();

  //USART3 clock enable
  RCC_USART3_ClockCmd();
  USART3_InitStructure.USART_BaudRate = 921600;
  USART3_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART3_InitStructure.USART_StopBits = USART_StopBits_1;
  USART3_InitStructure.USART_Parity = USART_Parity_No;
  USART3_InitStructure.USART_HardwareFlowControl =
    USART_HardwareFlowControl_None;
  USART3_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART3_ClockInitStructure.USART_Clock = USART_Clock_Disable;
  USART3_ClockInitStructure.USART_CPOL = USART_CPOL_Low;
  USART3_ClockInitStructure.USART_CPHA = USART_CPHA_2Edge;
  USART3_ClockInitStructure.USART_LastBit = USART_LastBit_Disable;
  USART_Init(USART3_CONFIG_NAME, &USART3_InitStructure);
  USART_ClockInit(USART3_CONFIG_NAME, &USART3_ClockInitStructure);

  // Enable USART3 selected from PIL config model.
  USART_Cmd(USART3_CONFIG_NAME, ENABLE);
}

/*******************************************************************************
 * Function Name  : USART3_IRQHandler
 * Description    : USART interrupt reception management.
 * Input          : -
 *******************************************************************************/
void USART3_IRQHandler(void);
void USART3_IRQHandler(void)
{
  if (USART_GetITStatus(USART3, USART_IT_RXNE) != RESET) {
    /* Read one byte from the receive data register */
    if (USART3_NbrOfDataInBuff < USART3_RX_BUFF_SIZE) {
      *USART3_WritePt++ = USART3->DR;
      USART3_NbrOfDataInBuff++;
      if (USART3_WritePt > &USART3_RxBuffer[USART3_RX_BUFF_SIZE])
        USART3_WritePt = USART3_RxBuffer;
    } else {
      /* Take care: Char is lost. Increase Buffer size.*/
      (void)USART3->DR;
    }
  }

  if (USART_GetITStatus(USART3, USART_IT_TXE) != RESET) {
    USART_SendData(USART3, *USART3_BufferSendPt++);
    USART3_NbCharSent++;
    if (--USART3_NbCharToSend <= 0)
      USART_ITConfig(USART3, USART_IT_TXE, DISABLE);
  }
}

/*******************************************************************************
 * Function Name  : TIM5_IRQHandler
 * Description    : This function handles TIM5 interrupt request.
 * Input          : -
 *******************************************************************************/
void TIM5_IRQHandler(void)
{
}

/*******************************************************************************
 * Function Name  : TIM4_IRQHandler
 * Description    : This function handles TIM4 interrupt request.
 * Input          : -
 *******************************************************************************/
void TIM4_IRQHandler(void)
{
}

/* Model step function */
void daq_step(void)
{
  real_T cnt;
  real_T j;
  int32_T i;
  uint16_T crc;
  real32_T y;
  uint8_T x[4];
  int32_T b_i;
  real32_T rtb_imuData[3];
  int32_T unnamed_idx_1;
  uint8_T msg_data[18];

  {
    /* user code (Output function Header) */
#ifndef USART1_IT_SEND

    u16 i = 0;
    char* charToSend;

#endif

    u16 NbData_Read = 0;               //Nb of data copied into the output data buffer
    int i;                             //Loop counter

#ifndef USART3_IT_SEND

    u16 i = 0;
    char* charToSend;

#endif

    //u16 NbData_Read = 0;               //Nb of data copied into the output data buffer
    //int i;                             //Loop counter

#ifndef USART6_IT_SEND

    u16 i = 0;
    char* charToSend;

#endif

    //u16 NbData_Read = 0;               //Nb of data copied into the output data buffer
    //int i;                             //Loop counter
    int OffsetADC1_L = 0;
    //u16 NbData_Read = 0;               //Nb of data copied into the output data buffer
    //int i;                             //Loop counter

#ifndef USART2_IT_SEND

    u16 i = 0;
    char* charToSend;

#endif

    uint16_t L_GPIOVal_GPIOG = GPIO_ReadOutputData(GPIOG) & ~(uint16_t)1216;
    uint16_t L_GPIOVal_GPIOH = GPIO_ReadOutputData(GPIOH) & ~(uint16_t)768;
    uint16_t L_GPIOVal_GPIOI = GPIO_ReadOutputData(GPIOI) & ~(uint16_t)2288;
    uint16_t L_GPIOVal_GPIOC = GPIO_ReadOutputData(GPIOC) & ~(uint16_t)40960;
    uint16_t L_GPIOVal_GPIOA = GPIO_ReadOutputData(GPIOA) & ~(uint16_t)16;
    uint16_t L_GPIOVal_GPIOD = GPIO_ReadOutputData(GPIOD) & ~(uint16_t)72;

    /* user code (Output function Body) */
#ifndef USART1_IT_RCV

    /* Pulling reception: Get received char while any and less than buff size*/
    while ((USART1->SR & USART_FLAG_RXNE) != (uint16_t)RESET &&
           USART1_NbrOfDataInBuff < 18) {
      /* Read one byte from the receive data register */
      *USART1_WritePt++ = USART1->DR;
      USART1_NbrOfDataInBuff++;
      if (USART1_WritePt > &USART1_RxBuffer[18])
        USART1_WritePt = USART1_RxBuffer;
    }

#endif

    /* Disable Rx interrupt during processing */
    USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);

    /* Processing when data has been received only*/
    if (USART1_NbrOfDataInBuff ) {
      for (i = 0; i< 18;i++) {
        USART1_RxOutputDataBuffer[i] = *USART1_ReadPt++;
        USART1_NbrOfDataInBuff--;
        NbData_Read++;
        if (USART1_ReadPt > &USART1_RxBuffer[18]) {
          USART1_ReadPt = USART1_RxBuffer;
        }

        if (USART1_NbrOfDataInBuff == 0) {
          break;
        }
      }
    }

    daq_Y.usart1_NbRcv = NbData_Read;

    /* Enable Rx interrupt after processing */
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    USART1_RxOutputDataBufferPt = USART1_RxOutputDataBuffer;

    {
      int_T i1;
      uint8_T *y1 = &daq_Y.usart1_RcvVal[0];
      for (i1=0; i1 < 18; i1++) {
        y1[i1] = *USART1_RxOutputDataBufferPt++;
      }
    }

#ifndef USART3_IT_RCV

    /* Pulling reception: Get received char while any and less than buff size*/
    while ((USART3->SR & USART_FLAG_RXNE) != (uint16_t)RESET &&
           USART3_NbrOfDataInBuff < 1000) {
      /* Read one byte from the receive data register */
      *USART3_WritePt++ = USART3->DR;
      USART3_NbrOfDataInBuff++;
      if (USART3_WritePt > &USART3_RxBuffer[1000])
        USART3_WritePt = USART3_RxBuffer;
    }

#endif

    /* Disable Rx interrupt during processing */
    USART_ITConfig(USART3, USART_IT_RXNE, DISABLE);

