batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
    /* Processing when data has been received only*/
    if (USART3_NbrOfDataInBuff ) {
      for (i = 0; i< 100;i++) {
        USART3_RxOutputDataBuffer[i] = *USART3_ReadPt++;
        USART3_NbrOfDataInBuff--;
        NbData_Read++;
        if (USART3_ReadPt > &USART3_RxBuffer[1000]) {
          USART3_ReadPt = USART3_RxBuffer;
        }

        if (USART3_NbrOfDataInBuff == 0) {
          break;
        }
      }
    }

    daq_Y.usart3_NbRcv = NbData_Read;

    /* Enable Rx interrupt after processing */
    USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
    USART3_RxOutputDataBufferPt = USART3_RxOutputDataBuffer;

    {
      int_T i1;
      uint8_T *y1 = &daq_Y.usart3_RcvVal[0];
      for (i1=0; i1 < 100; i1++) {
        y1[i1] = *USART3_RxOutputDataBufferPt++;
      }
    }

#ifndef USART6_IT_RCV

    /* Pulling reception: Get received char while any and less than buff size*/
    while ((USART6->SR & USART_FLAG_RXNE) != (uint16_t)RESET &&
           USART6_NbrOfDataInBuff < 1000) {
      /* Read one byte from the receive data register */
      *USART6_WritePt++ = USART6->DR;
      USART6_NbrOfDataInBuff++;
      if (USART6_WritePt > &USART6_RxBuffer[1000])
        USART6_WritePt = USART6_RxBuffer;
    }

#endif

    /* Disable Rx interrupt during processing */
    USART_ITConfig(USART6, USART_IT_RXNE, DISABLE);

    /* Processing when data has been received only*/
    if (USART6_NbrOfDataInBuff ) {
      for (i = 0; i< 100;i++) {
        USART6_RxOutputDataBuffer[i] = *USART6_ReadPt++;
        USART6_NbrOfDataInBuff--;
        NbData_Read++;
        if (USART6_ReadPt > &USART6_RxBuffer[1000]) {
          USART6_ReadPt = USART6_RxBuffer;
        }

        if (USART6_NbrOfDataInBuff == 0) {
          break;
        }
      }
    }

    daq_Y.usart6_NbRcv = NbData_Read;

    /* Enable Rx interrupt after processing */
    USART_ITConfig(USART6, USART_IT_RXNE, ENABLE);
    USART6_RxOutputDataBufferPt = USART6_RxOutputDataBuffer;

    {
      int_T i1;
      uint8_T *y1 = &daq_Y.usart6_RcvVal[0];
      for (i1=0; i1 < 100; i1++) {
        y1[i1] = *USART6_RxOutputDataBufferPt++;
      }
    }

#ifdef ADC1_USE_DMA

    daq_Y.ADC123_IN0 = ADCConvertedValue[0];

#elif defined (ADC_USE_DMA)

    daq_Y.ADC123_IN0 = ADCConvertedValue[OffsetADC1_L + 0];

#else

    daq_Y.ADC123_IN0 = *(uint16_t*)ADC1_DR_ADDRESS;

#endif

#ifdef ADC1_USE_DMA

    daq_Y.ADC123_IN3 = ADCConvertedValue[1];

#elif defined (ADC_USE_DMA)

    daq_Y.ADC123_IN3 = ADCConvertedValue[OffsetADC1_L + 1];

#else

    daq_Y.ADC123_IN3 = *(uint16_t*)ADC1_DR_ADDRESS;

#endif

#ifndef USART2_IT_RCV

    /* Pulling reception: Get received char while any and less than buff size*/
    while ((USART2->SR & USART_FLAG_RXNE) != (uint16_t)RESET &&
           USART2_NbrOfDataInBuff < 18) {
      /* Read one byte from the receive data register */
      *USART2_WritePt++ = USART2->DR;
      USART2_NbrOfDataInBuff++;
      if (USART2_WritePt > &USART2_RxBuffer[18])
        USART2_WritePt = USART2_RxBuffer;
    }

#endif

    /* Disable Rx interrupt during processing */
    USART_ITConfig(USART2, USART_IT_RXNE, DISABLE);

    /* Processing when data has been received only*/
    if (USART2_NbrOfDataInBuff ) {
      for (i = 0; i< 18;i++) {
        USART2_RxOutputDataBuffer[i] = *USART2_ReadPt++;
        USART2_NbrOfDataInBuff--;
        NbData_Read++;
        if (USART2_ReadPt > &USART2_RxBuffer[18]) {
          USART2_ReadPt = USART2_RxBuffer;
        }

        if (USART2_NbrOfDataInBuff == 0) {
          break;
        }
      }
    }

    daq_Y.usart2_NbRcv = NbData_Read;

    /* Enable Rx interrupt after processing */
    USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
    USART2_RxOutputDataBufferPt = USART2_RxOutputDataBuffer;

    {
      int_T i1;
      uint8_T *y1 = &daq_Y.usart2_RcvVal[0];
      for (i1=0; i1 < 18; i1++) {
        y1[i1] = *USART2_RxOutputDataBufferPt++;
      }
    }

    daq_B.GPIO_Read1 = GPIO_ReadInputData(GPIOB);
    daq_B.GPIO_Read2 = GPIO_ReadInputData(GPIOA);
    daq_B.GPIO_Read4 = GPIO_ReadInputData(GPIOI);
    daq_B.GPIO_Read5 = GPIO_ReadInputData(GPIOH);

    /* DigitalClock: '<S2>/Digital Clock' */
    daq_Y.time = ((daq_M->Timing.clockTick0) * 0.2);

    /* S-Function Block: <S10>/USART_Send4 */

    /* S-Function Block: <S10>/USART_Receive4 */

    /* S-Function Block: <S12>/USART_Send4 */

    /* S-Function Block: <S12>/USART_Receive4 */

    /* S-Function Block: <S13>/USART_Send4 */

    /* S-Function Block: <S13>/USART_Receive4 */

    /* S-Function Block: <S5>/ADC_Read */

    /* Outport: '<Root>/Estop' */
    daq_Y.Estop = 0.0;

    /* Outport: '<Root>/do1' */
    daq_Y.do1 = 0.0;

    /* Outport: '<Root>/do2' */
    daq_Y.do2 = 0.0;

    /* Outport: '<Root>/do3' */
    daq_Y.do3 = 0.0;

    /* Outport: '<Root>/do4' */
    daq_Y.do4 = 0.0;

    /* Outport: '<Root>/do5' */
    daq_Y.do5 = 0.0;

    /* S-Function Block: <S11>/USART_Receive4 */

    /* MATLAB Function: '<S9>/parse_imu' incorporates:
     *  UnitDelay: '<S9>/Unit Delay'
     */
    /* MATLAB Function 'DAQ/imuDataParse/parse_imu': '<S14>:1' */
    /*  msg = uint8(zeros(1,150)); */
    /*  Buffer size equal to msg size. */
    /* '<S14>:1:16' */
    rtb_imuData[0] = daq_DW.UnitDelay_DSTATE[0];
    rtb_imuData[1] = daq_DW.UnitDelay_DSTATE[1];
    rtb_imuData[2] = daq_DW.UnitDelay_DSTATE[2];

    /* '<S14>:1:19' */
    for (i = 0; i < 15; i++) {
      /* '<S14>:1:19' */
      if ((daq_Y.usart2_RcvVal[i] == 250) && (daq_Y.usart2_RcvVal[1 + i] == 1) &&
          (daq_Y.usart2_RcvVal[2 + i] == 8) && (daq_Y.usart2_RcvVal[3 + i] == 0)
          && (18 - i >= 18)) {
        /* '<S14>:1:20' */
        /* '<S14>:1:21' */
        /* '<S14>:1:22' */
        /* '<S14>:1:23' */
        /* '<S14>:1:24' */
        /*  Test checksum  */
        /*  d0 = ['FA','01','28','00','E5','68','2C','43','5C', '21', 'B3','3F','22','A3','CE','3F','90','B5','D8', 'B9', 'B0','29',... */
        /*      '28','3A', 'A0', '37' ,'66','BA','B3','D1']; */
        /*   */
        /*  d1 = []; */
        /*  for i=1:2:length(d0) */
        /*      d1 = [d1 hex2dec(d0(i:i+1))]; */
        /*  end */
        /*   */
        /*  d1 = uint8(d1); */
        /*   */
        /*  msg = d1; */
        crc = 0U;
        unnamed_idx_1 = 17 - i;
        for (b_i = 0; b_i < unnamed_idx_1; b_i++) {
          crc = (uint16_T)((uint16_T)((uint16_T)((uint32_T)crc >> 8) | (uint16_T)
                            (crc << 8)) ^ daq_Y.usart2_RcvVal[(i + b_i) + 1]);
          crc ^= (uint16_T)((uint32_T)(crc & 255) >> 4);
          crc ^= (uint16_T)(crc << 12);
          crc ^= (uint16_T)((crc & 255) << 5);
        }

        if (!(crc != 0)) {
          /* '<S14>:1:25' */
          /* '<S14>:1:26' */
          unnamed_idx_1 = -i;
          for (b_i = 0; b_i <= unnamed_idx_1 + 17; b_i++) {
            msg_data[b_i] = daq_Y.usart2_RcvVal[i + b_i];
          }

          /* '<S14>:1:28' */
          cnt = 5.0;

          /* '<S14>:1:29' */
          j = 1.0;

          /* '<S14>:1:52' */
          for (unnamed_idx_1 = 0; unnamed_idx_1 < 3; unnamed_idx_1++) {
            /* '<S14>:1:52' */
            /*                                      imuData(j) = typecast(msg(cnt:cnt+imuBinaryMsg.msgType.size.Ypr/3-1),... */
            /*                                      imuBinaryMsg.msgType.type.Ypr); */
            /* '<S14>:1:55' */
            x[0] = msg_data[(int32_T)cnt - 1];
            x[1] = msg_data[(int32_T)(cnt + 1.0) - 1];
            x[2] = msg_data[(int32_T)(cnt + 2.0) - 1];
            x[3] = msg_data[(int32_T)(cnt + 3.0) - 1];
            memcpy(&y, &x[0], 4U);
            rtb_imuData[(int32_T)j - 1] = y;

            /* '<S14>:1:57' */
            cnt += 4.0;

            /* '<S14>:1:58' */
            j++;

            /* '<S14>:1:52' */
          }
        }
      }

      /* '<S14>:1:19' */
    }

    /* End of MATLAB Function: '<S9>/parse_imu' */

    /* Outport: '<Root>/imuData' */
    daq_Y.imuData[0] = rtb_imuData[0];
    daq_Y.imuData[1] = rtb_imuData[1];
    daq_Y.imuData[2] = rtb_imuData[2];

    /* S-Function Block: <S11>/USART_Send4 */

    /* S-Function Block: <S6>/GPIO_Read1 */

    /* S-Function Block: <S6>/GPIO_Read2 */

    /* S-Function Block: <S6>/GPIO_Read4 */

    /* S-Function Block: <S6>/GPIO_Read5 */

    /* S-Function Block: <S6>/GPIO_Write */

