batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
    /* S-Function Block: <S6>/GPIO_Write1 */

    /* S-Function Block: <S6>/GPIO_Write2 */

    /* S-Function Block: <S6>/GPIO_Write3 */

    /* S-Function Block: <S6>/GPIO_Write4 */

    /* S-Function Block: <S6>/GPIO_Write5 */

    /* user code (Output function Trailer) */
#ifdef USART1_IT_SEND

    USART1_BufferSendPt = (char *)&daq_U.usart1_SendVal[0];
    USART1_NbCharToSend = daq_U.usart1_Nb2Send;
    if (USART1_NbCharToSend) {
      /* Initialize nb of char sent to 0 */
      USART1_NbCharSent = 0;

      /* Send char is allowed */
      USART_ITConfig(USART1, USART_IT_TXE, ENABLE);
    }

    daq_Y.usart1_NbSent = USART1_NbCharSent;

#endif

#ifndef USART1_IT_SEND

    charToSend = (char *)&daq_U.usart1_SendVal[0];
    daq_Y.usart1_NbSent = 0;
    for (i=0; i<daq_U.usart1_Nb2Send; i++) {
      while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET) ;
      USART_SendData(USART1, *charToSend++);
      daq_Y.usart1_NbSent++;
    }

#endif

#ifdef USART3_IT_SEND

    USART3_BufferSendPt = (char *)&daq_U.usart3_SendVal[0];
    USART3_NbCharToSend = daq_U.usart3_Nb2Send;
    if (USART3_NbCharToSend) {
      /* Initialize nb of char sent to 0 */
      USART3_NbCharSent = 0;

      /* Send char is allowed */
      USART_ITConfig(USART3, USART_IT_TXE, ENABLE);
    }

    daq_Y.usart3_NbSent = USART3_NbCharSent;

#endif

#ifndef USART3_IT_SEND

    charToSend = (char *)&daq_U.usart3_SendVal[0];
    daq_Y.usart3_NbSent = 0;
    for (i=0; i<daq_U.usart3_Nb2Send; i++) {
      while (USART_GetFlagStatus(USART3, USART_FLAG_TXE) == RESET) ;
      USART_SendData(USART3, *charToSend++);
      daq_Y.usart3_NbSent++;
    }

#endif

#ifdef USART6_IT_SEND

    USART6_BufferSendPt = (char *)&daq_U.usart6_SendVal[0];
    USART6_NbCharToSend = daq_U.usart6_Nb2Send;
    if (USART6_NbCharToSend) {
      /* Initialize nb of char sent to 0 */
      USART6_NbCharSent = 0;

      /* Send char is allowed */
      USART_ITConfig(USART6, USART_IT_TXE, ENABLE);
    }

    daq_Y.usart6_NbSent = USART6_NbCharSent;

#endif

#ifndef USART6_IT_SEND

    charToSend = (char *)&daq_U.usart6_SendVal[0];
    daq_Y.usart6_NbSent = 0;
    for (i=0; i<daq_U.usart6_Nb2Send; i++) {
      while (USART_GetFlagStatus(USART6, USART_FLAG_TXE) == RESET) ;
      USART_SendData(USART6, *charToSend++);
      daq_Y.usart6_NbSent++;
    }

#endif

#ifdef USART2_IT_SEND

    USART2_BufferSendPt = (char *)&daq_U.usart2_SendVal[0];
    USART2_NbCharToSend = daq_U.usart2_Nb2Send;
    if (USART2_NbCharToSend) {
      /* Initialize nb of char sent to 0 */
      USART2_NbCharSent = 0;

      /* Send char is allowed */
      USART_ITConfig(USART2, USART_IT_TXE, ENABLE);
    }

    daq_B.USART_Send4_m = USART2_NbCharSent;

#endif

#ifndef USART2_IT_SEND

    charToSend = (char *)&daq_U.usart2_SendVal[0];
    daq_B.USART_Send4_m = 0;
    for (i=0; i<daq_U.usart2_Nb2Send; i++) {
      while (USART_GetFlagStatus(USART2, USART_FLAG_TXE) == RESET) ;
      USART_SendData(USART2, *charToSend++);
      daq_B.USART_Send4_m++;
    }

#endif

    GPIO_Write(GPIOG, L_GPIOVal_GPIOG | ((uint16_t)((uint16_T)0U) & (uint16_t)
                1216));
    GPIO_ToggleBits(GPIOG,GPIO_Pin_13);
    GPIO_ToggleBits(GPIOG,GPIO_Pin_14);
    GPIO_Write(GPIOH, L_GPIOVal_GPIOH | ((uint16_t)((uint16_T)0U) & (uint16_t)
                768));
    GPIO_Write(GPIOI, L_GPIOVal_GPIOI | ((uint16_t)((uint16_T)0U) & (uint16_t)
                2288));
    GPIO_Write(GPIOC, L_GPIOVal_GPIOC | ((uint16_t)((uint16_T)0U) & (uint16_t)
                40960));
    GPIO_Write(GPIOA, L_GPIOVal_GPIOA | ((uint16_t)((uint16_T)0U) & (uint16_t)16));
    GPIO_Write(GPIOD, L_GPIOVal_GPIOD | ((uint16_t)((uint16_T)0U) & (uint16_t)72));
  }

  /* Update for UnitDelay: '<S9>/Unit Delay' */
  daq_DW.UnitDelay_DSTATE[0] = rtb_imuData[0];
  daq_DW.UnitDelay_DSTATE[1] = rtb_imuData[1];
  daq_DW.UnitDelay_DSTATE[2] = rtb_imuData[2];

  /* Update for S-Function (TIMERS_Config): '<S7>/Timers' */

  /* Timer frequency is an input port */
  TIM5->ARR = 21000000 / daq_P.pwm5_freq_Value -1;
  if (daq_U.pwm5_1 < 0) {
    /* Disable output and complementary output */
    //            TIM5->BDTR &= 0x7FFF;  //MOE = 0
    TIM5->BDTR |= 0x8000;              //MOE = 1
    TIM5->BDTR &= 0xF7FF;              //OSSR = 0

    //            TIM5->CCER |= 0x4;     //CC1NE = 1
    //            TIM5->CCER &= 0xFFFE;  //CC1E = 0
    TIM5->CCER &= 0xFFFA;              //CC1E = 0 CC1NE = 0
    TIM5->CR2 &= 0xFCFF;               //OIS1 = 0 OIS1N = 0
  } else {
    // Enable output and complementary output and update dutyCycle
    TIM5->BDTR |= 0x8000;              //MOE = 1
    TIM5->CCER |= 0x5;                 //CC1NE = 1 and CC1E = 1

    // Channel1 duty cycle is an input port
    TIM5->CCR1 = daq_U.pwm5_1 * TIM5->ARR / 100;
  }

  if (daq_U.pwm5_2 < 0) {
    /* Disable output and complementary output */
    //            TIM5->BDTR &= 0x7FFF;  //MOE = 0
    TIM5->BDTR |= 0x8000;              //MOE = 1
    TIM5->BDTR &= 0xF7FF;              //OSSR = 0

    //            TIM5->CCER |= 0x40;    //CC2NE = 1
    //            TIM5->CCER &= 0xFFEF;  //CC2E = 0
    TIM5->CCER &= 0xFFAF;              //CC2E = 0 CC2NE = 0
    TIM5->CR2 &= 0xF3FF;               //OIS2 = 0 OIS2N = 0
  } else {
    /* Enable output and complementary output and update dutyCycle*/
    TIM5->BDTR |= 0x8000;              //MOE = 1
    TIM5->CCER |= 0x50;                //CC2NE = 1 and CC2E = 1

    /* Channel2 duty cycle is an input port */
    TIM5->CCR2 = daq_U.pwm5_2 * TIM5->ARR / 100;
  }

  /* Update for S-Function (TIMERS_Config): '<S7>/Timers1' */

  /* Timer frequency is an input port */
  TIM4->ARR = 21000000 / daq_P.pwm4_freq_Value -1;
  if (daq_U.pwm5_3 < 0) {
    /* Disable output and complementary output */
    //            TIM4->BDTR &= 0x7FFF;  //MOE = 0
    TIM4->BDTR |= 0x8000;              //MOE = 1
    TIM4->BDTR &= 0xF7FF;              //OSSR = 0

    //            TIM4->CCER |= 0x4;     //CC1NE = 1
    //            TIM4->CCER &= 0xFFFE;  //CC1E = 0
    TIM4->CCER &= 0xFFFA;              //CC1E = 0 CC1NE = 0
    TIM4->CR2 &= 0xFCFF;               //OIS1 = 0 OIS1N = 0
  } else {
    // Enable output and complementary output and update dutyCycle
    TIM4->BDTR |= 0x8000;              //MOE = 1
    TIM4->CCER |= 0x5;                 //CC1NE = 1 and CC1E = 1

    // Channel1 duty cycle is an input port
    TIM4->CCR1 = daq_U.pwm5_3 * TIM4->ARR / 100;
  }

  /* Update absolute time for base rate */
  /* The "clockTick0" counts the number of times the code of this task has
   * been executed. The resolution of this integer timer is 0.2, which is the step size
   * of the task. Size of "clockTick0" ensures timer will not overflow during the
   * application lifespan selected.
   */
  daq_M->Timing.clockTick0++;
}

/* Model initialize function */
void daq_initialize(void)
{
  /* Registration code */

  /* initialize real-time model */
  (void) memset((void *)daq_M, 0,
                sizeof(RT_MODEL_daq));

