batrobot/B2_Science_firmware/daq_stm32F4xx/daq.c
  /* block I/O */
  (void) memset(((void *) &daq_B), 0,
                sizeof(B_daq));

  /* states (dwork) */
  (void) memset((void *)&daq_DW, 0,
                sizeof(DW_daq));

  /* external inputs */
  (void) memset((void *)&daq_U, 0,
                sizeof(ExtU_daq));

  /* external outputs */
  (void) memset((void *)&daq_Y, 0,
                sizeof(ExtY_daq));

  /* user code (Start function Body) */

  /* ADC1 Initialization */
  ADC1_Init();

#if ( defined (ADC_USE_DMA) || defined (ADC1_USE_DMA) || defined (ADC2_USE_DMA) || defined (ADC3_USE_DMA) )

  /*ADC common DMA configuration*/
  ADC_DMA_Common_Init();

#endif

  /* ADC Initialization */
  ADC_Common_Init();

  /* GPIOA Configuration */
  GPIOA_Configuration();

  /* GPIOB Configuration */
  GPIOB_Configuration();

  /* GPIOC Configuration */
  GPIOC_Configuration();

  /* GPIOD Configuration */
  GPIOD_Configuration();

  /* GPIOE Configuration */
  GPIOE_Configuration();

  /* GPIOF Configuration */
  GPIOF_Configuration();

  /* GPIOG Configuration */
  GPIOG_Configuration();

  /* GPIOH Configuration */
  GPIOH_Configuration();

  /* GPIOI Configuration */
  GPIOI_Configuration();

  /* Usart configuration */
  USART6_Config();

  /* Enable USART6 Rcv interrupt */
  NVIC_USART6_InitStructure.NVIC_IRQChannel = USART6_IRQn ;
  NVIC_USART6_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_USART6_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_USART6_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_USART6_InitStructure);
  USART_ITConfig(USART6, USART_IT_RXNE, ENABLE);

  /* Usart configuration */
  USART2_Config();

  /* Enable USART2 Rcv interrupt */
  NVIC_USART2_InitStructure.NVIC_IRQChannel = USART2_IRQn ;
  NVIC_USART2_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_USART2_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_USART2_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_USART2_InitStructure);
  USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);

  /* Usart configuration */
  USART1_Config();

  /* Enable USART1 Rcv interrupt */
  NVIC_USART1_InitStructure.NVIC_IRQChannel = USART1_IRQn ;
  NVIC_USART1_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_USART1_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_USART1_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_USART1_InitStructure);
  USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);

  /* Usart configuration */
  USART3_Config();

  /* Enable USART3 Rcv interrupt */
  NVIC_USART3_InitStructure.NVIC_IRQChannel = USART3_IRQn ;
  NVIC_USART3_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_USART3_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_USART3_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_USART3_InitStructure);
  USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);

  /* Start for S-Function (TIMERS_Config): '<S7>/Timers' */
  ;

  /* Start for S-Function (TIMERS_Config): '<S7>/Timers1' */
  ;

  /* Start for S-Function (ADC_Init): '<S1>/ADC_Init' */
  ;
  ;

  /* Start for S-Function (ADC_Common_Init): '<S1>/STM32_ADC_Common_Init' */
  ;

  /* Start for S-Function (GPIOA_Config): '<S3>/GPIOA_Config' */
  ;

  /* Start for S-Function (GPIOB_Config): '<S3>/GPIOB_Config' */
  ;

  /* Start for S-Function (GPIOC_Config): '<S3>/GPIOC_Config' */
  ;

  /* Start for S-Function (GPIOD_Config): '<S3>/GPIOD_Config' */
  ;

  /* Start for S-Function (GPIOE_Config): '<S3>/GPIOE_Config' */
  ;

  /* Start for S-Function (GPIOF_Config): '<S3>/GPIOF_Config' */
  ;

  /* Start for S-Function (GPIOG_Config): '<S3>/GPIOG_Config1' */
  ;

  /* Start for S-Function (GPIOH_Config): '<S3>/GPIOH_Config' */
  ;

  /* Start for S-Function (GPIOI_Config): '<S3>/GPIOI_Config' */
  ;

  /* Start for S-Function (USART_Config): '<S4>/USART_Config' */
  ;

  /* Start for S-Function (USART_Config): '<S4>/USART_Config1' */
  ;

  /* Start for S-Function (USART_Config): '<S4>/USART_Config2' */
  ;

  /* Start for S-Function (USART_Config): '<S4>/USART_Config3' */
  ;

  /* user code (Start function Trailer) */

  /* TIM5 Configuration */
  TIM5_Configuration();

  /* TIM4 Configuration */
  TIM4_Configuration();

  /* ADC1 START */
  ADC1_Start();

  /* InitializeConditions for UnitDelay: '<S9>/Unit Delay' */
  daq_DW.UnitDelay_DSTATE[0] = daq_P.UnitDelay_InitialCondition;
  daq_DW.UnitDelay_DSTATE[1] = daq_P.UnitDelay_InitialCondition;
  daq_DW.UnitDelay_DSTATE[2] = daq_P.UnitDelay_InitialCondition;
}

/* File trailer for Real-Time Workshop generated code.
 *
 * [EOF] daq.c
 */
